// Написать программу, которая из имеющегося массива строк формирует массив из строк, длина которых меньше либо равна 3 символа.
// Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма.

using System;

/*string[] array = new string[] {"hello", "2", "world", ":-)"};
var result = new string[array.Length];
var size = 0;
foreach (var value in array)
{
    if (value.Length <= 3)
    {
        result[size] = value;
        size++;
    }
}
Console.WriteLine(string.Join(Environment.NewLine, result, 0, size));*/


/*string[] array = new string[] {"1234", "1567", "-2", "computer science"};
var result = new string[array.Length];
var size = 0;
foreach (var value in array)
{
    if (value.Length <= 3)
    {
        result[size] = value;
        size++;
    }
}
Console.WriteLine(string.Join(Environment.NewLine, result, 0, size));*/


/*string[] array = new string[] {"Russia", "Denmark", "Kazan"};
var result = new string[array.Length];
var size = 0;
foreach (var value in array)
{
    if (value.Length <= 3)
    {
        result[size] = value;
        size++;
    }
}
Console.WriteLine(string.Join(Environment.NewLine, result, 0, size));*/